import 'domain/sigth.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Мечеть «Кул-Шариф»',
    details:
    'Мечеть «Кул-Шариф» (тат. «Кол Шәриф» мәчете) — главная соборная джума-мечеть республики Татарстан и города Казани (с 2005 года)[1]; расположена на территории Казанского кремля; одна из главных достопримечательностей города.',
    url: 'https://upload.wikimedia.org/wikipedia/commons/d/d1/Kazan_Kremlin_Qolsharif_Mosque_08-2016_img2.jpg',
    lat: 55.7982396,
    lon: 49.1049289,
    type: 'type1',
  ),
  Sight(
    name: 'Каза́нский кремль',
    details:
    'Каза́нский кремль (тат. Казан кирмәне, Qazan kirmäne) — древнейшая часть и цитадель Казани, комплекс архитектурных, исторических и археологических памятников, раскрывающих многовековую историю города: археологические остатки первого (XII—XIII вв.), второго (XIV—XV вв.) и третьего городищ (XV—XVI вв.); белокаменный кремль, ряд храмов и зданий, имеющих большую историко-архитектурную и культурную ценность.',
    url: 'https://upload.wikimedia.org/wikipedia/commons/1/15/Kazan_Kremlin_-_panoramio_%286%29.jpg',
    lat: 55.7989416,
    lon: 49.1061747,
    type: 'type2',
  ),
  Sight(
    name: 'Мечеть «Кул-Шариф»',
    details:
    'Мечеть «Кул-Шариф» (тат. «Кол Шәриф» мәчете) — главная соборная джума-мечеть республики Татарстан и города Казани (с 2005 года)[1]; расположена на территории Казанского кремля; одна из главных достопримечательностей города.',
    url: 'https://upload.wikimedia.org/wikipedia/commons/d/d1/Kazan_Kremlin_Qolsharif_Mosque_08-2016_img2.jpg',
    lat: 55.7982396,
    lon: 49.1049289,
    type: 'type1',
  ),
  Sight(
    name: 'Каза́нский кремль',
    details:
    'Каза́нский кремль (тат. Казан кирмәне, Qazan kirmäne) — древнейшая часть и цитадель Казани, комплекс архитектурных, исторических и археологических памятников, раскрывающих многовековую историю города: археологические остатки первого (XII—XIII вв.), второго (XIV—XV вв.) и третьего городищ (XV—XVI вв.); белокаменный кремль, ряд храмов и зданий, имеющих большую историко-архитектурную и культурную ценность.',
    url: 'https://upload.wikimedia.org/wikipedia/commons/1/15/Kazan_Kremlin_-_panoramio_%286%29.jpg',
    lat: 55.7989416,
    lon: 49.1061747,
    type: 'type2',
  ),
];
