import 'domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Каза́нский кремль',
    details:
        'Каза́нский кремль (тат. Казан кирмәне, Qazan kirmäne) — древнейшая часть и цитадель Казани, комплекс архитектурных, исторических и археологических памятников, раскрывающих многовековую историю города: археологические остатки первого (XII—XIII вв.), второго (XIV—XV вв.) и третьего городищ (XV—XVI вв.); белокаменный кремль, ряд храмов и зданий, имеющих большую историко-архитектурную и культурную ценность.',
    url:
        'https://upload.wikimedia.org/wikipedia/commons/1/15/Kazan_Kremlin_-_panoramio_%286%29.jpg',
    lat: 55.7989416,
    lon: 49.1061747,
    type: 'Исторический',
  ),
  Sight(
    name: 'Мечеть «Кул-Шариф»',
    details:
        'Мечеть «Кул-Шариф» (тат. «Кол Шәриф» мәчете) — главная соборная джума-мечеть республики Татарстан и города Казани (с 2005 года)',
    url:
        'https://tur-ray.ru/wp-content/uploads/2019/11/ploschad-pered-mechetyu.jpg',
    lat: 55.7982396,
    lon: 49.1049289,
    type: 'Памятник',
    workedTime: 'закрыто до 09:00',
  ),
  Sight(
    name: 'Центр семьи «Казан»',
    details:
        'Центр семьи «Казан» (в разговорной речи просто «Чаша» [1]) — главный дворец бракосочетаний (ЗАГС) в городе Казань и республике Татарстан. Одна из главных современных достопримечательностей города, обыгрывающих его название ввиду того, что построен в виде огромного котла-казана. На крыше расположена смотровая площадка с видом на Казанский кремль, Кремлёвскую набережную и округу. Открыт 5 июля 2013 года.',
    url: 'https://sun9-67.userapi.com/c639324/v639324215/46fb8/UD_5W7SI22Y.jpg',
    lat: 55.812785,
    lon: 49.108237,
    type: 'Достопримечательность',
  ),
  Sight(
    name: 'Дворе́ц земледе́льцев',
    details:
        'Дворе́ц земледе́льцев (тат. Игенчеләр сарае) — здание в историческом центре Казани, Вахитовском районе. Расположен на Дворцовой площади вблизи северной стены Казанского кремля и набережной Казанки. Штаб-квартира Министерства сельского хозяйства и продовольствия Республики Татарстан, Главного управления ветеринарии, Республиканского агропромышленного центра инвестиций и новаций и ряда подведомственных организаций. Дворец земледельцев стал одной из наиболее известных современных достопримечательностей города.',
    url:
        'https://upload.wikimedia.org/wikipedia/commons/1/1d/Minselhoz_tree.jpg',
    lat: 55.800509,
    lon: 49.112010,
    type: 'Достопримечательность',
  ),
];
